require "os"

tap "1password/tap"
tap "AlexanderWillner/tap"
tap "derailed/k9s"
tap "epk/epk"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nats-io/nats-tools"
tap "ngrok/ngrok"
tap "tinygo-org/tools"

brew "asciinema"
brew "binaryen"
brew "caddy"
brew "deno"
brew "doctl"
brew "figlet"
brew "fish"
brew "fisher"
brew "flyctl"
brew "fzf"
brew "gcc@5"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "golang-migrate"
brew "gotop"
brew "helm"
brew "helmfile"
brew "hub"
brew "jq"
brew "k9s"
brew "lazygit"
brew "lima"
brew "llvm"
brew "lua-language-server"
brew "operator-sdk"
brew "neofetch"
brew "neovim"
brew "k3sup"
brew "k3d"
brew "neovim-remote"
brew "node"
brew "packer"
brew "pinentry"
brew "python"
brew "rg"
brew "ruby@2.7"
brew "rustup-init"
brew "starship"
brew "step"
brew "stylua"
brew "terraform"
brew "tinygo"
brew "vercel-cli"
brew "watch"
brew "yaml-language-server"

if OS.mac?
  # Mac apps
  cask "1password"
  cask "1password-cli"
  cask "amethyst"
  cask "brave-browser"
  cask "cheatsheet"
  cask "discord"
  cask "docker"
  cask "figma"
  cask "font-fira-code-nerd-font"
  cask "font-inter"
  cask "font-sf-mono-nerd-font"
  cask "google-chrome"
  cask "google-cloud-sdk"
  cask "gpg-suite"
  cask "kitty"
  cask "maccy"
  cask "ngrok/ngrok/ngrok"
  cask "obs"
  cask "signal"
  cask "slack"
  cask "soundsource"
  cask "visual-studio-code"
  cask "zoom"
end
