require "os"

tap "1password/tap"
tap "AlexanderWillner/tap"
tap "cue-lang/tap"
tap "epk/epk"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "kajabi/tap"
tap "knative/client"
tap "koekeishiya/formulae"
tap "nats-io/nats-tools"
tap "ngrok/ngrok"
tap "tinygo-org/tools"

brew "asciinema"
brew "bat"
brew "binaryen"
brew "caddy"
brew "ctags"
brew "cue"
brew "deno"
brew "doctl"
brew "esbuild"
brew "fd"
brew "figlet"
brew "fish"
brew "fisher"
brew "flyctl"
brew "fzf"
brew "gcc@5"
brew "gh"
brew "git"
brew "go"
brew "golang-migrate"
brew "gotop"
brew "hey"
brew "hub"
brew "jq"
brew "k3d"
brew "kajabi"
brew "kind"
brew "kn"
brew "ko"
brew "kubectl"
brew "lazygit"
brew "llvm"
brew "lua-language-server"
brew "nats-server"
brew "neofetch"
brew "neovim"
brew "neovim-remote"
brew "node"
brew "pinentry"
brew "protobuf"
brew "python"
brew "rg"
brew "ruby@2.7"
brew "rust"
brew "rust-analyzer"
brew "starship"
brew "step"
brew "stylua"
brew "terraform"
brew "things.sh"
brew "tinygo"
brew "vercel-cli"
brew "vhs"
brew "viddy"
brew "watch"
brew "yaml-language-server"

if OS.mac?
  # Mac apps
  cask "1password"
  cask "1password-cli"
  cask "amethyst"
  cask "brave-browser"
  cask "cheatsheet"
  cask "discord"
  cask "docker"
  cask "figma"
  cask "font-fira-code-nerd-font"
  cask "font-inter"
  cask "font-sf-mono-nerd-font"
  cask "google-chrome"
  cask "gpg-suite"
  cask "handbrake"
  cask "imageoptim"
  cask "kitty"
  cask "maccy"
  cask "ngrok/ngrok/ngrok"
  cask "obs"
  cask "obsidian"
  cask "signal"
  cask "slack"
  cask "soundsource"
  cask "visual-studio-code"
  cask "whichspace"
  cask "zoom"
end
