require "os"

tap "1password/tap"
tap "AlexanderWillner/tap"
tap "FelixKratz/formulae"
tap "derailed/k9s"
tap "epk/epk"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nats-io/nats-tools"
tap "stripe/stripe-cli"
tap "tinygo-org/tools"
tap "FelixKratz/formulae"

brew "asciinema"
brew "binaryen"
brew "borders"
brew "caddy"
brew "dotnet"
brew "eksctl"
brew "figlet"
brew "fish"
brew "fisher"
brew "fzf"
brew "gcc@5"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "golang-migrate"
brew "goreleaser"
brew "helm"
brew "helmfile"
brew "jo"
brew "jq"
brew "k3sup"
brew "k9s"
brew "ko"
brew "lazygit"
brew "lima"
brew "llvm"
brew "neofetch"
brew "neovim"
brew "neovim-remote"
brew "node"
brew "pinentry"
brew "pkg-config"
brew "python"
brew "rg"
brew "ruby@2.7"
brew "skhd"
brew "starship"
brew "stripe"
brew "terraform"
brew "tinygo"
brew "watch"
brew "yabai"

if OS.mac?
  # Mac apps
  cask "1password"
  cask "1password-cli"
  cask "brave-browser"
  cask "cheatsheet"
  cask "discord"
  cask "docker"
  cask "figma"
  cask "font-fira-code-nerd-font"
  cask "font-hack-nerd-font"
  cask "font-inter"
  cask "font-sf-mono-nerd-font"
  cask "font-sf-pro"
  cask "font-symbols-only-nerd-font"
  cask "google-chrome"
  cask "gpg-suite"
  cask "intellij-idea-ce"
  cask "kitty"
  cask "maccy"
  cask "monitorcontrol"
  cask "obs"
  cask "raycast"
  cask "sf-symbols"
  cask "slack"
  cask "soundsource"
  cask "visual-studio-code"
  cask "zoom"
end
